---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ElectricalSetting
source: html/4b482121-4205-c62b-35a7-04c526122f04.htm
---
# ElectricalSetting Methods

Add a new distribution system type to project.